In [1]:
import numpy as np
import pandas as pd

In [15]:
data = np.random.randn(5, 6)
data

array([[-0.71440792, -0.1595509 , -0.20501129, -0.04221154, -0.09304939,
        -1.16110725],
       [ 0.42301337, -0.6497726 , -0.1990407 ,  0.82894999,  1.08923324,
        -0.29836626],
       [-0.2621381 , -0.71213591, -0.40505849,  0.98626056, -0.83755711,
         1.25788828],
       [-1.21520797,  0.63004717, -0.72663659,  0.02063038,  0.69086998,
        -2.15194564],
       [-0.01888307, -1.34121153, -0.44716755, -0.41812251,  0.62048777,
         0.12923194]])

In [16]:
col = 'Q W E R T Y'.split(' ')

In [17]:
df = pd.DataFrame(data, columns = col, index = 'A B C D E'.split(' '))
df

          Q         W         E         R         T         Y
A -0.714408 -0.159551 -0.205011 -0.042212 -0.093049 -1.161107
B  0.423013 -0.649773 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.712136 -0.405058  0.986261 -0.837557  1.257888
D -1.215208  0.630047 -0.726637  0.020630  0.690870 -2.151946
E -0.018883 -1.341212 -0.447168 -0.418123  0.620488  0.129232

In [18]:
df.reset_index() ## Menggunakan index default (urutan angka 0 - sekian)
## index awal akan menjadi kolom baru

  index         Q         W         E         R         T         Y
0     A -0.714408 -0.159551 -0.205011 -0.042212 -0.093049 -1.161107
1     B  0.423013 -0.649773 -0.199041  0.828950  1.089233 -0.298366
2     C -0.262138 -0.712136 -0.405058  0.986261 -0.837557  1.257888
3     D -1.215208  0.630047 -0.726637  0.020630  0.690870 -2.151946
4     E -0.018883 -1.341212 -0.447168 -0.418123  0.620488  0.129232

In [19]:
df.set_index('T')

                  Q         W         E         R         Y
T
-0.093049 -0.714408 -0.159551 -0.205011 -0.042212 -1.161107
 1.089233  0.423013 -0.649773 -0.199041  0.828950 -0.298366
-0.837557 -0.262138 -0.712136 -0.405058  0.986261  1.257888
 0.690870 -1.215208  0.630047 -0.726637  0.020630 -2.151946
 0.620488 -0.018883 -1.341212 -0.447168 -0.418123  0.129232

In [20]:
## Sorting

In [21]:
df

          Q         W         E         R         T         Y
A -0.714408 -0.159551 -0.205011 -0.042212 -0.093049 -1.161107
B  0.423013 -0.649773 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.712136 -0.405058  0.986261 -0.837557  1.257888
D -1.215208  0.630047 -0.726637  0.020630  0.690870 -2.151946
E -0.018883 -1.341212 -0.447168 -0.418123  0.620488  0.129232

In [22]:
df.sort_values('Y')
## df.sort_values(kolom, ascending = )
## ascending menentukan metode pengurutan
## ascending = True ==> Pengurutan secara ascending => dari kecil ke besar
## ascending = False ==> pengurutan secara descending => dari besar ke kecil
## jika parameter ascending tidak ditentukan, maka pengurutan menggunakan metode default => dari kecil ke besar (ascending= True) 
## kolom ==> data akan diurutkan berdasarkan kolom ini

          Q         W         E         R         T         Y
D -1.215208  0.630047 -0.726637  0.020630  0.690870 -2.151946
A -0.714408 -0.159551 -0.205011 -0.042212 -0.093049 -1.161107
B  0.423013 -0.649773 -0.199041  0.828950  1.089233 -0.298366
E -0.018883 -1.341212 -0.447168 -0.418123  0.620488  0.129232
C -0.262138 -0.712136 -0.405058  0.986261 -0.837557  1.257888

In [23]:
df.sort_values('R', ascending=False)

          Q         W         E         R         T         Y
C -0.262138 -0.712136 -0.405058  0.986261 -0.837557  1.257888
B  0.423013 -0.649773 -0.199041  0.828950  1.089233 -0.298366
D -1.215208  0.630047 -0.726637  0.020630  0.690870 -2.151946
A -0.714408 -0.159551 -0.205011 -0.042212 -0.093049 -1.161107
E -0.018883 -1.341212 -0.447168 -0.418123  0.620488  0.129232

In [24]:
df.sort_values(['E', 'T']) ## mengurutkan data berdasarkan kolom E dan T, keduanya menggunakan metode ascending

          Q         W         E         R         T         Y
D -1.215208  0.630047 -0.726637  0.020630  0.690870 -2.151946
E -0.018883 -1.341212 -0.447168 -0.418123  0.620488  0.129232
C -0.262138 -0.712136 -0.405058  0.986261 -0.837557  1.257888
A -0.714408 -0.159551 -0.205011 -0.042212 -0.093049 -1.161107
B  0.423013 -0.649773 -0.199041  0.828950  1.089233 -0.298366

In [25]:
df.sort_values(['E', 'T'], ascending = [False, True])
## mengurutkan data berdasarkan kolom E dan T
## pertama data akan diurutkan berdasarkan kolom E secara descending 
## selanjutnya data akan diurutkan berdasarkan kolom T secara ascending

          Q         W         E         R         T         Y
B  0.423013 -0.649773 -0.199041  0.828950  1.089233 -0.298366
A -0.714408 -0.159551 -0.205011 -0.042212 -0.093049 -1.161107
C -0.262138 -0.712136 -0.405058  0.986261 -0.837557  1.257888
E -0.018883 -1.341212 -0.447168 -0.418123  0.620488  0.129232
D -1.215208  0.630047 -0.726637  0.020630  0.690870 -2.151946

In [26]:
df

          Q         W         E         R         T         Y
A -0.714408 -0.159551 -0.205011 -0.042212 -0.093049 -1.161107
B  0.423013 -0.649773 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.712136 -0.405058  0.986261 -0.837557  1.257888
D -1.215208  0.630047 -0.726637  0.020630  0.690870 -2.151946
E -0.018883 -1.341212 -0.447168 -0.418123  0.620488  0.129232

In [27]:
df.sort_index(ascending = False) ## mengurutkan berdasarkan Index, secara Descending

          Q         W         E         R         T         Y
E -0.018883 -1.341212 -0.447168 -0.418123  0.620488  0.129232
D -1.215208  0.630047 -0.726637  0.020630  0.690870 -2.151946
C -0.262138 -0.712136 -0.405058  0.986261 -0.837557  1.257888
B  0.423013 -0.649773 -0.199041  0.828950  1.089233 -0.298366
A -0.714408 -0.159551 -0.205011 -0.042212 -0.093049 -1.161107

In [35]:
df > -0.5

       Q      W      E     R      T      Y
A  False   True   True  True   True  False
B   True  False   True  True   True   True
C   True  False   True  True  False   True
D  False   True  False  True   True  False
E   True  False   True  True   True   True

In [38]:
df2 = df[df > -0.5].drop(columns='W')

In [39]:
df2

          Q         E         R         T         Y
A       NaN -0.205011 -0.042212 -0.093049       NaN
B  0.423013 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.405058  0.986261       NaN  1.257888
D       NaN       NaN  0.020630  0.690870       NaN
E -0.018883 -0.447168 -0.418123  0.620488  0.129232

In [40]:
## Check Missing value

In [41]:
df2.isna()

       Q      E      R      T      Y
A   True  False  False  False   True
B  False  False  False  False  False
C  False  False  False   True  False
D   True   True  False  False   True
E  False  False  False  False  False

In [42]:
df2.isna().sum() ## mengecek Jumlah Missing value tiap kolom

Q    2
E    1
R    0
T    1
Y    2
dtype: int64

In [43]:
df2.isnull().sum()

Q    2
E    1
R    0
T    1
Y    2
dtype: int64

In [45]:
df2.dropna() ## akan menghapus baris yg memiliki NaN - Missing value
## menggunakan axis default, axis = 0

          Q         E         R         T         Y
B  0.423013 -0.199041  0.828950  1.089233 -0.298366
E -0.018883 -0.447168 -0.418123  0.620488  0.129232

In [46]:
df2.dropna(axis=1)
## akan menghapus KOLOM yg memiliki NaN - Missing value
## karena axis = 1

          R
A -0.042212
B  0.828950
C  0.986261
D  0.020630
E -0.418123

In [47]:
df2

          Q         E         R         T         Y
A       NaN -0.205011 -0.042212 -0.093049       NaN
B  0.423013 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.405058  0.986261       NaN  1.257888
D       NaN       NaN  0.020630  0.690870       NaN
E -0.018883 -0.447168 -0.418123  0.620488  0.129232

In [49]:
df2.dropna(thresh=3) ## Jumlah minimal KOLOM yg tidak NaN dalam 1 baris
## Jika mencapai minimal, baris tidak akan dihapus

          Q         E         R         T         Y
A       NaN -0.205011 -0.042212 -0.093049       NaN
B  0.423013 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.405058  0.986261       NaN  1.257888
E -0.018883 -0.447168 -0.418123  0.620488  0.129232

In [51]:
df2

          Q         E         R         T         Y
A       NaN -0.205011 -0.042212 -0.093049       NaN
B  0.423013 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.405058  0.986261       NaN  1.257888
D       NaN       NaN  0.020630  0.690870       NaN
E -0.018883 -0.447168 -0.418123  0.620488  0.129232

In [52]:
df2.fillna('Missing')

          Q         E         R         T         Y
A   Missing -0.205011 -0.042212 -0.093049   Missing
B  0.423013 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.405058  0.986261   Missing  1.257888
D   Missing   Missing  0.020630   0.69087   Missing
E -0.018883 -0.447168 -0.418123  0.620488  0.129232

In [53]:
df2.fillna(0)

          Q         E         R         T         Y
A  0.000000 -0.205011 -0.042212 -0.093049  0.000000
B  0.423013 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.405058  0.986261  0.000000  1.257888
D  0.000000  0.000000  0.020630  0.690870  0.000000
E -0.018883 -0.447168 -0.418123  0.620488  0.129232

In [56]:
df2['Y'].mean()

0.36291798836562067

In [57]:
df2['Y']

A         NaN
B   -0.298366
C    1.257888
D         NaN
E    0.129232
Name: Y, dtype: float64

In [59]:
df2['Y'].fillna(df2['Y'].mean()) ## mengisi Kolom Y yg berisi Missing value (NaN) menggunakan nilai rata-rata dari Kolom Y

A    0.362918
B   -0.298366
C    1.257888
D    0.362918
E    0.129232
Name: Y, dtype: float64

In [60]:
df2.mean()

Q    0.047331
E   -0.314070
R    0.275101
T    0.576885
Y    0.362918
dtype: float64

In [61]:
df2.fillna(df2.mean()) ## Akan mengisi Missing Value setiap kolom menggunakan nilai rata-rata dari kolom tersebut

          Q         E         R         T         Y
A  0.047331 -0.205011 -0.042212 -0.093049  0.362918
B  0.423013 -0.199041  0.828950  1.089233 -0.298366
C -0.262138 -0.405058  0.986261  0.576885  1.257888
D  0.047331 -0.314070  0.020630  0.690870  0.362918
E -0.018883 -0.447168 -0.418123  0.620488  0.129232

In [62]:
## Aggregation

In [63]:
data = {
    'company' : ['Amz', 'Amz', 'MS', 'MS', 'Meta', 'Meta'],
    'person' : ['Sam', 'Jack', 'Andre', 'Fanta', 'Cindy', 'Ari'],
    'sales' : [200, 400, 250, 600, 740, 120],
    'salary' : [12000000, 17000000, 13000000, 25000000, 30000000, 10000000]
}

In [64]:
df_sales = pd.DataFrame(data)

In [65]:
df_sales

  company person  sales    salary
0     Amz    Sam    200  12000000
1     Amz   Jack    400  17000000
2      MS  Andre    250  13000000
3      MS  Fanta    600  25000000
4    Meta  Cindy    740  30000000
5    Meta    Ari    120  10000000

In [ ]:
- Group by ==> SQL
- Crosstab ==> Original pandas
- Pivot Table ==> ms excell

## Group By
- Fungsi Group by memiliki kegunaan yg sama seperti Group by pada SQL
- Harus ada kolom yg diterapkan fungsi aggregasi (average, sum, count, dst)
- Kolom yg diterapkan fungsi aggregat harus Numerik
- Ada 3 Komponen Utama di fungsi Group by :
    1. Kolom kategorikal untuk Grouping (dasar pengelompokkan)
    2. Kolom numerikal untuk dasar/kolom yg diterapkan fungsi aggregasi
    3. Fungsi aggregasinya

In [66]:
df_sales.groupby('company')
## di dalam kurung harus menggunakan kolom yg berisi data kategorikal
## agar dapat diambil insight nya - dianalisa

In [68]:
df_sales.groupby('company').mean(numeric_only=True)

         sales      salary
company
Amz      300.0  14500000.0
MS       425.0  19000000.0
Meta     430.0  20000000.0

## Keterangan
- Kolom company : Kolom kategorikal sebagai dasar penghelompokkan
- Kolom sales & salary : Kolom numerikal yg diterapkan fungsi aggregasi
- .mean() : fungsi aggregasi

In [69]:
df_sales[['company', 'sales']].groupby('company').min()

         sales
company
Amz        200
MS         250
Meta       120

In [70]:
df_sales[['company', 'sales']].groupby('company').describe()

        sales
        count   mean         std    min    25%    50%    75%    max
company
Amz       2.0  300.0  141.421356  200.0  250.0  300.0  350.0  400.0
MS        2.0  425.0  247.487373  250.0  337.5  425.0  512.5  600.0
Meta      2.0  430.0  438.406204  120.0  275.0  430.0  585.0  740.0

In [71]:
df_sales[['company', 'sales']].groupby('company').describe().T

company             Amz          MS        Meta
sales count    2.000000    2.000000    2.000000
      mean   300.000000  425.000000  430.000000
      std    141.421356  247.487373  438.406204
      min    200.000000  250.000000  120.000000
      25%    250.000000  337.500000  275.000000
      50%    300.000000  425.000000  430.000000
      75%    350.000000  512.500000  585.000000
      max    400.000000  600.000000  740.000000

In [72]:
df_sales[['company', 'sales']].groupby('company').describe().T['Amz']

sales  count      2.000000
       mean     300.000000
       std      141.421356
       min      200.000000
       25%      250.000000
       50%      300.000000
       75%      350.000000
       max      400.000000
Name: Amz, dtype: float64

In [73]:
df_sales[['company', 'sales']].groupby('company').describe().T['Amz']['sales']

count      2.000000
mean     300.000000
std      141.421356
min      200.000000
25%      250.000000
50%      300.000000
75%      350.000000
max      400.000000
Name: Amz, dtype: float64

In [74]:
df_sales[['company', 'sales']].groupby('company').describe().T['Amz']['sales']['std']

141.4213562373095

In [75]:
df_sales[['company', 'sales']].groupby('company').describe().T['Amz']['sales']['75%']

350.0

In [76]:
df_sales[['person', 'sales']].groupby('person').sum()

        sales
person
Andre     250
Ari       120
Cindy     740
Fanta     600
Jack      400
Sam       200

In [77]:
df_sales[['person', 'sales', 'company']].groupby(['company','person']).sum()

                sales
company person
Amz     Jack      400
        Sam       200
MS      Andre     250
        Fanta     600
Meta    Ari       120
        Cindy     740

In [78]:
df_sales.shape
## untuk melihat struktur dari dataframe ==> jumlah baris dan kolom
## baris, kolom

(6, 4)

In [79]:
df_sales.columns
## untuk melihat list kolom

Index(['company', 'person', 'sales', 'salary'], dtype='object')

In [81]:
df_sales.dtypes
## untuk melihat tipe data tiap kolom

company    object
person     object
sales       int64
salary      int64
dtype: object

In [82]:
df_sales['company'].unique()
## untuk menampilkan isi data unik dari kolom

array(['Amz', 'MS', 'Meta'], dtype=object)

In [83]:
df_sales['company'].nunique()
## untuk menampilkan Jumlah isi data unik dari kolom

3

In [84]:
len(df_sales['company'].unique())

3

In [85]:
df_sales['company'].value_counts()
## menampilkan jumlah baris dari masing-masing data unik dari suatu kolom

company
Amz     2
MS      2
Meta    2
Name: count, dtype: int64

In [87]:
df_sales.info()
## menampilkan informasi dari dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  6 non-null      object
 1   person   6 non-null      object
 2   sales    6 non-null      int64
 3   salary   6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [88]:
## Menerapkan suatu function ke dataframe

In [89]:
def pajak(x):
    return x * 0.025

In [90]:
df_sales

  company person  sales    salary
0     Amz    Sam    200  12000000
1     Amz   Jack    400  17000000
2      MS  Andre    250  13000000
3      MS  Fanta    600  25000000
4    Meta  Cindy    740  30000000
5    Meta    Ari    120  10000000

In [91]:
df_sales['salary'].apply(pajak)

0    300000.0
1    425000.0
2    325000.0
3    625000.0
4    750000.0
5    250000.0
Name: salary, dtype: float64

In [93]:
df_sales['pajak'] = df_sales['salary'].apply(pajak)
## akan menambahkan kolom baru dg nama 'pajak' yg berisi hasil dari operasi Function pajak ke setiap baris kolom Salary

In [94]:
## Combine Dataframe

In [95]:
## concat

In [96]:
dataA = {
'A': ['A0', 'A1', 'A2', 'A3'],
'B':['B0', 'B1', 'B2', 'B3'],
'C':['C0', 'C1', 'C2', 'C3'],
'D':['D0', 'D1', 'D2', 'D3']}

In [97]:
dfA = pd.DataFrame(dataA, index=[0,1,2,3])

In [98]:
dfA

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [99]:
dataB = {
'A': ['A4', 'A5', 'A6', 'A7'],
'B':['B4', 'B5', 'B6', 'B7'],
'C':['C4', 'C5', 'C6', 'C7'],
'D':['D4', 'D5', 'D6', 'D7']}

In [100]:
dfB = pd.DataFrame(dataB, index=[4,5,6,7])

In [101]:
dfB

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [102]:
dataC = {
'A': ['A8', 'A9', 'A10', 'A11'],
'B':['B8', 'B9', 'B10', 'B11'],
'C':['C8', 'C9', 'C10', 'C11'],
'D':['D8', 'D9', 'D10', 'D11']}

In [103]:
dfC = pd.DataFrame(dataC, index=[8,9,10,11])

In [104]:
dfC

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [105]:
## Menggabungkan beberapa dataframe

In [106]:
pd.concat([dfA, dfB, dfC])
## axis tidak ditentukan sehingga menggunakan axis = 0 (nilai default)
## dfB dan dfC akan ditambahkan ke baris dfA
## Nama KOLOM harus sama

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [107]:
pd.concat([dfA, dfB, dfC], axis=1)
## akan menambahkan KOLOM
## dfB dan dfC akan menambahkan kolom dfA
##  Index HARUS SAMA, jika berbeda akan menghasilkan NaN Values

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [108]:
## merge

In [109]:
data1 = {
    'key' : ['K0', 'K1', 'K2', 'K3'],
'A': ['A0', 'A1', 'A2', 'A3'],
'B':['B0', 'B1', 'B2', 'B3']
}

In [110]:
Left = pd.DataFrame(data1)
Left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [111]:
data2 = {
'key':['K0', 'K1', 'K3', 'K4'],
    'C':['C0', 'C1', 'C2', 'C3'],
'D':['D0', 'D1', 'D2', 'D3']
}

In [112]:
Right = pd.DataFrame(data2)
Right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K3  C2  D2
3  K4  C3  D3

In [115]:
pd.merge(Left, Right, on='key') ## metode join ketika tidak ditentukan berarti menggunakan INNER JOIN
## hanya menampilkan data yg KEY nya ada di dataframe LEFT dan di dataframe RIGHT

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C2  D2

In [116]:
pd.merge(Left, Right, on='key', how='outer') 
## menampilkan seluruh data yg ada di dataframe LEFT dan dataframe RIGHT
## jika ada selisih baris akan berisi NaN value

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3   C2   D2
4  K4  NaN  NaN   C3   D3

In [117]:
pd.merge(Left, Right, on='key', how='left')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3   C2   D2

In [118]:
pd.merge(Left, Right, on='key', how='right')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K3   A3   B3  C2  D2
3  K4  NaN  NaN  C3  D3

In [ ]:
## metode merge menggunakan KOLOM yg nama dan isinya sama

In [120]:
left = Left.set_index('key')

In [121]:
right = Right.set_index('key')

In [122]:
left.join(right)
## Metode JOIN default yg digunakan adalah LEFT JOIN
## Key yg digunakan adalah INDEX, sehingga index untuk kedua dataframe harus sama

      A   B    C    D
key
K0   A0  B0   C0   D0
K1   A1  B1   C1   D1
K2   A2  B2  NaN  NaN
K3   A3  B3   C2   D2

In [123]:
left.join(right, how='outer')

       A    B    C    D
key
K0    A0   B0   C0   D0
K1    A1   B1   C1   D1
K2    A2   B2  NaN  NaN
K3    A3   B3   C2   D2
K4   NaN  NaN   C3   D3

In [124]:
left.join(right, how='inner')

      A   B   C   D
key
K0   A0  B0  C0  D0
K1   A1  B1  C1  D1
K3   A3  B3  C2  D2

In [125]:
left.join(right, how='right')

       A    B   C   D
key
K0    A0   B0  C0  D0
K1    A1   B1  C1  D1
K3    A3   B3  C2  D2
K4   NaN  NaN  C3  D3